vcr_cassettes/with_card_token_one_appointment_no_promotion_various_prices.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/charges
    body:
      encoding: US-ASCII
      string: amount=1150&application_fee=150&currency=usd&description=Student%3A+Bob+Dole%2C+Tutor%3A+Bob+Dole%2C+Course%3A+Math+101%3A+Pre+Calculus%2C+School%3A+University+of+Georgia%2C+Appts%3A+1%2C+Time%28s%29%3A+[%22Wednesday%2C+February+17+at++7%3A00+AM%22]&destination=acct_17djkoFyj0w2ytDK&source=tok_17djks4Iy02hWvBE2QG7Zx7w
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.31.0
      Authorization:
      - Bearer sk_test_4VObNRAiXCBixyd9lpO2sdeP
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.31.0","lang":"ruby","lang_version":"2.2.0 p0 (2014-12-25)","platform":"x86_64-linux","engine":"ruby","publisher":"stripe","uname":"Linux
        version 4.1.13-boot2docker (root@11aafb97cfeb) (gcc version 4.9.2 (Debian
        4.9.2-10) ) #1 SMP Fri Nov 20 19:05:50 UTC 2015","hostname":"3266f24816bd"}'
      Content-Length:
      - '319'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 15 Feb 2016 16:28:06 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1676'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_7ueViPSPnTsbAB
      Stripe-Version:
      - '2015-08-19'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "ch_17epCj4Iy02hWvBE50Fno6XU",
          "object": "charge",
          "amount": 1150,
          "amount_refunded": 0,
          "application_fee": "fee_7ueVdtiPN5XNhq",
          "balance_transaction": "txn_17epCj4Iy02hWvBE7abWH72z",
          "captured": true,
          "created": 1455553685,
          "currency": "usd",
          "customer": null,
          "description": "Student: Bob Dole, Tutor: Bob Dole, Course: Math 101: Pre Calculus, School: University of Georgia, Appts: 1, Time(s): [\"Wednesday, February 17 at  7:00 AM\"]",
          "destination": "acct_17djkoFyj0w2ytDK",
          "dispute": null,
          "failure_code": null,
          "failure_message": null,
          "fraud_details": {},
          "invoice": null,
          "livemode": false,
          "metadata": {},
          "order": null,
          "paid": true,
          "receipt_email": null,
          "receipt_number": null,
          "refunded": false,
          "refunds": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/charges/ch_17epCj4Iy02hWvBE50Fno6XU/refunds"
          },
          "shipping": null,
          "source": {
            "id": "card_17djkr4Iy02hWvBEBhtsvIo3",
            "object": "card",
            "address_city": null,
            "address_country": null,
            "address_line1": null,
            "address_line1_check": null,
            "address_line2": null,
            "address_state": null,
            "address_zip": null,
            "address_zip_check": null,
            "brand": "Visa",
            "country": "US",
            "customer": null,
            "cvc_check": null,
            "dynamic_last4": null,
            "exp_month": 12,
            "exp_year": 2016,
            "fingerprint": "ZmaKPeHcm3bbIjWC",
            "funding": "credit",
            "last4": "4242",
            "metadata": {},
            "name": null,
            "tokenization_method": null
          },
          "statement_descriptor": null,
          "status": "succeeded",
          "transfer": "tr_17epCj4Iy02hWvBEM1ZmdaYI"
        }
    http_version: 
  recorded_at: Mon, 15 Feb 2016 16:28:06 GMT
recorded_with: VCR 3.0.1
